Revit 2025 API
NoiseType Enumeration
 The enumerated type representing the permitted values for the asset property "NoiseType" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum NoiseType
Public Enumeration NoiseType
public enum class NoiseType
type NoiseType
Members
Member name | Value | Description
Regular | 0
Fractal | 1
Turbulence | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace